Revit 2024 API
ElectricalDemandFactorDefinition.AdditionalLoad Property
 Additional load to be included during demand load calculation.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double AdditionalLoad { get; set; }
Visual Basic
Public Property AdditionalLoad As Double
	Get
	Set
Visual C++
public:
property double AdditionalLoad {
	double get ();
	void set (double value);
}
See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace